{
  "privacy": {
    "title": "Сиёсати ҳифзи маълумот",
    "lastUpdated": "24 декабри 2025",
    "sections": {
      "responsible": {
        "title": "Масъули ҳифзи маълумот",
        "content": "Масъул барои коркарди маълумоти шахсӣ дар ин сомона:\n\nНом: Муҳаммадалӣ Раҳимов\nСуроға: Firmianstrasse 3, 94036 Passau, Олмон\nТелефон: +49 1636168323\nПочтаи электронӣ: rahimov.muhammadali1704@gmail.com"
      },
      "overview": {
        "title": "Назари умумӣ",
        "content": "Ҳифзи маълумоти шахсии шумо барои мо бисёр муҳим аст. Мо маълумоти шуморо танҳо дар чорчӯбаи қонунҳои Иттиҳоди Аврупо ва Олмон, махсусан GDPR (Регламенти умумии ҳифзи маълумот) коркард мекунем.\n\nИн сомона як сомонаи шахсӣ ва иттилоотӣ аст ва ягон ташкилоти тиҷоратӣ надорад. Мо маълумоти шуморо дар пойгоҳи додаҳо захира намекунем."
      },
      "dataCollection": {
        "title": "Кадом маълумот ҷамъ карда мешавад",
        "content": "Ҳангоми истифодаи сомонаи мо, маълумоти зайл ба таври худкор ҷамъ карда мешавад:\n\n• Суроғаи IP\n• Вақт ва санаи муроҷиат\n• Браузер ва системаи операционии шумо\n• Саҳифаҳое, ки шумо боздид кардед\n\nИн маълумот дар файлҳои лог (Server-Log-Dateien) захира карда мешавад ва барои таҳлили техникӣ ва беҳтар кардани сомона истифода мешавад."
      },
      "cookies": {
        "title": "Истифодаи Cookie",
        "content": "Сомонаи мо аз cookies истифода мекунад. Cookies файлҳои хурди матнӣ ҳастанд, ки дар компютери шумо захира карда мешаванд.\n\nМо танҳо cookies зарурӣ истифода мекунем:\n\n• Захираи интихоби забон\n• Захираи розигии Cookie\n• Кори техникии сомона\n\nМо бидуни розигии шумо ягон cookies таҳлилӣ ё пайгирикунанда истифода намекунем. Шумо метавонед дар танзимоти браузери худ cookies-ро ғайрифаъол кунед."
      },
      "contactForm": {
        "title": "Шакли тамос",
        "content": "Агар шумо тавассути сомона бо мо тамос гиред, маълумоти пешниҳодкардаи шумо (ном, почтаи электронӣ, паём) танҳо барои коркарди дархости шумо истифода мешавад ва баъди ҷавоб нест карда мешавад."
      },
      "externalLinks": {
        "title": "Истиноди берунӣ",
        "content": "Сомонаи мо истинодҳо ба сомонаҳои берунӣ дорад (масалан, GitHub, Portfolio). Мо барои мазмуни ин сомонаҳо масъулият надорем. Барои ҳифзи маълумот дар он сомонаҳо лутфан сиёсати ҳифзи маълумоти онҳоро мутолиа кунед."
      },
      "hosting": {
        "title": "Ҷойгиршавии сомона (Hosting)",
        "content": "Ин сомона дар Vercel ҷойгир шудааст. Vercel Inc., 340 S Lemon Ave #4133, Walnut, CA 91789, USA.\n\nVercel метавонад маълумоти техникӣ (суроғаи IP, вақти муроҷиат) барои таъмини хизматрасонӣ ҷамъ кунад. Барои маълумоти бештар дар бораи ҳифзи маълумот дар Vercel, ба сомонаи онҳо муроҷиат кунед."
      },
      "userRights": {
        "title": "Ҳуқуқҳои шумо",
        "content": "Мувофиқи GDPR шумо ҳуқуқҳои зеринро доред:\n\n• Ҳуқуқи маълумот дар бораи маълумоти захирашуда\n• Ҳуқуқи тасҳеҳи маълумоти нодуруст\n• Ҳуқуқи несткунии маълумот\n• Ҳуқуқи маҳдудкунии коркард\n• Ҳуқуқи интиқоли маълумот\n• Ҳуқуқи эътироз ба коркард\n\nБарои истифода аз ин ҳуқуқҳо, лутфан бо мо тавассути маълумоти дар боло зикршуда тамос гиред."
      },
      "dataProtectionAuthority": {
        "title": "Ҳуқуқи шикоят",
        "content": "Шумо ҳуқуқ доред, ки ба мақомоти назорати ҳифзи маълумот шикоят кунед, агар фикр кунед, ки коркарди маълумоти шумо ғайриқонунӣ аст."
      },
      "changes": {
        "title": "Тағйироти сиёсати ҳифзи маълумот",
        "content": "Мо ҳуқуқ дорем, ки ин сиёсати ҳифзи маълумотро тағйир диҳем. Версияи ҷории ҳамеша дар ин саҳифа дастрас аст."
      },
      "disclaimer": {
        "title": "Эзоҳ",
        "content": "Ин сомонаи шахсӣ ва иттилоотӣ аст. Мо ягон фаъолияти тиҷоратӣ надорем ва маълумотро дар пойгоҳи додаҳо захира намекунем. Ҳама маълумоти пешниҳодшуда танҳо барои мақсадҳои иттилоотӣ аст."
      }
    }
  },
  "cookies": {
    "title": "Сиёсати Cookie",
    "lastUpdated": "24 декабри 2025",
    "sections": {
      "what": {
        "title": "Cookie чист?",
        "content": "Cookie файли хурди матнӣ аст, ки вебсомона онро дар компютер ё дастгоҳи мобилии шумо захира мекунад. Cookies ба сомона имкон медиҳанд, ки шуморо эътироф кунад ва танзимоти шуморо дар хотир нигоҳ дорад."
      },
      "types": {
        "title": "Намудҳои Cookie",
        "content": "Мо ду навъи cookies истифода мекунем:\n\n1. Cookies зарурӣ:\n• Барои кори асосии сомона зарурӣ ҳастанд\n• Интихоби забонро захира мекунанд\n• Розигии Cookie-ро дар хотир нигоҳ медоранд\n• Бидуни розигӣ истифода мешаванд\n\n2. Cookies ихтиёрӣ:\n• Барои таҳлил ва омор\n• Танҳо бо розигии шумо истифода мешаванд\n• Дар ҳоли ҳозир дар сомона нест"
      },
      "consent": {
        "title": "Механизми розигӣ",
        "content": "Ҳангоми аввалин боздиди сомона, шумо баннери Cookie мебинед. Шумо метавонед интихоб кунед:\n\n• Ҳамаро қабул кардан - ҳамаи cookies фаъол мешаванд\n• Танҳо зарурӣ - танҳо cookies зарурӣ истифода мешаванд\n• Бештар фаҳмед - ба ин саҳифа гузаред\n\nРозигии шумо дар браузери шумо захира карда мешавад."
      },
      "withdraw": {
        "title": "Бозпасгирии розигӣ",
        "content": "Шумо метавонед дар ҳар вақт розигии худро бозпас гиред:\n\n• Cookies-ро дар браузери худ нест кунед\n• Захираи маҳаллии браузерро тоза кунед\n• Баннери Cookie дубора пайдо мешавад\n\nБаъди бозпасгирӣ танҳо cookies зарурӣ истифода мешаванд."
      },
      "thirdParty": {
        "title": "Cookies тарафҳои сеюм",
        "content": "Мо ҳоло аз cookies тарафҳои сеюм истифода намекунем. Агар дар оянда чунин cookies илова шаванд, мо шуморо аз ин огоҳ мекунем ва розигӣ мепурсем."
      },
      "control": {
        "title": "Идораи Cookies",
        "content": "Шумо метавонед cookies-ро дар браузери худ идора кунед:\n\n• Chrome: Танзимот > Махфият ва амният > Cookies\n• Firefox: Танзимот > Махфият ва амният\n• Safari: Афзалиятҳо > Махфият\n• Edge: Танзимот > Cookies ва иҷозатҳои сомона\n\nТавре ки шумо cookies-ро манъ кунед, баъзе функсияҳои сомона кор накарда метавонанд."
      },
      "moreInfo": {
        "title": "Маълумоти иловагӣ",
        "content": "Барои саволҳо дар бораи истифодаи cookies, лутфан бо мо тамос гиред:\n\nПочтаи электронӣ: rahimov.muhammadali1704@gmail.com"
      }
    }
  },
  "imprint": {
    "title": "Маълумоти ҳуқуқӣ",
    "lastUpdated": "24 декабри 2025",
    "sections": {
      "responsible": {
        "title": "Масъул барои мазмун",
        "content": "Мувофиқи моддаи 5 TMG ва моддаи 18 (2) MStV:\n\nНом: Муҳаммадалӣ Раҳимов\nСуроға: Firmianstrasse 3\n94036 Passau\nОлмон\n\nТелефон: +49 1636168323\nПочтаи электронӣ: rahimov.muhammadali1704@gmail.com"
      },
      "websiteType": {
        "title": "Намуди сомона",
        "content": "Ин сомонаи шахсӣ, иттилоотӣ ва портфолио аст. Сомона:\n\n• Ягон ташкилоти тиҷоратӣ ба қайд нагирифтааст\n• Фаъолияти тиҷоратӣ надорад\n• Савдои электронӣ (E-Commerce) надорад\n• Маълумоти корбаронро дар пойгоҳи додаҳо захира намекунад\n\nҲамаи маълумоти пешниҳодшуда барои мақсадҳои иттилоотӣ ва таҳсилӣ аст."
      },
      "liability": {
        "title": "Масъулияти мазмун",
        "content": "Мазмуни саҳифаҳои мо бо дақиқати зиёд омода карда шудааст. Бо вуҷуди ин, мо барои дурустӣ, пурраӣ ва навбудии маълумот кафолат дода наметавонем.\n\nМувофиқи §§ 7-10 TMG, мо ҳамчун пешниҳандаи хидмат барои мазмуни худ масъулият дорем, вале барои санҷиши маълумоти берунӣ ё таҳқиқоти фаъолона вазифа надорем.\n\nАгар мо аз вайронкунии қонун огоҳ шавем, мо фавран мазмунро тоза мекунем."
      },
      "externalLinks": {
        "title": "Масъулият барои истинодҳо",
        "content": "Сомонаи мо истинодҳо ба сомонаҳои берунӣ дорад. Мо барои мазмуни онҳо ягон назорат надорем ва масъулият намегирем.\n\nИстинодҳо дар вақти гузоштан санҷида шуда буданд ва ягон вайронкунии қонун вуҷуд надошт. Назорати доимии истинодҳо бидуни далели мушаххаси вайронкунӣ ғайриимкон аст.\n\nАгар аз вайронкунии ҳуқуқ огоҳ шавем, мо фавран истинодҳои дахлдорро нест мекунем."
      },
      "copyright": {
        "title": "Ҳуқуқи муаллиф",
        "content": "Мазмуни ин сомона (матн, тасвир, графика, код) таҳти ҳуқуқи муаллиф қарор дорад ва мутааллиқи Муҳаммадалӣ Раҳимов аст.\n\nИстифода, такрор ё паҳнкунии мазмун бидуни иҷозати хаттии соҳиби ҳуқуқи муаллиф манъ аст.\n\nБаъзе қисмҳои сомона метавонанд маводи таҳти литсензияҳои озод (Open Source) бошанд, ки дар ин сурат литсензияи дахлдор татбиқ мешавад."
      },
      "disputeResolution": {
        "title": "Ҳалли низоъҳо",
        "content": "Комиссияи Аврупо платформаи онлайн барои ҳалли низоъҳои истеъмолкунандагон пешниҳод мекунад: https://ec.europa.eu/consumers/odr\n\nМо дар рӯйхати дастурҳои ҳалли низоъҳо иштирок надорем ва барои истифода аз онҳо ҳеҷ вазифае надорем."
      },
      "disclaimer": {
        "title": "Эзоҳи умумӣ",
        "content": "Ин сомона яктарафа барои мақсадҳои иттилоотӣ эҷод шудааст. Маълумот 'чунон ки ҳаст' пешниҳод мешавад ва мо барои зарар, ки аз истифодаи маълумот ба вуҷуд ояд, масъулият намегирем.\n\nМувофиқи §312i (1) sentence 1 Nr. 1-3 ва §312i (2) BGB мо аз ҳуқуқи бозгашти истеъмолкунандагон озод ҳастем, зеро мо хадамоти иҷтимоӣ пешниҳод мекунем."
      }
    }
  },
  "cookieBanner": {
    "title": "Мо Cookies истифода мебарем",
    "description": "Мо аз cookies барои таъмини функсияҳои асосӣ ва беҳтар кардани таҷрибаи шумо истифода мебарем. Шумо метавонед интихоб кунед, ки кадом cookies қабул кунед.",
    "acceptAll": "Ҳамаро қабул кунам",
    "rejectOptional": "Танҳо зарурӣ",
    "moreInfo": "Бештар фаҳмед",
    "essentialOnly": "Танҳо cookies зарурӣ истифода мешаванд"
  }
}
