{
  "privacy": {
    "title": "Политика конфиденциальности",
    "lastUpdated": "24 декабря 2025 г.",
    "sections": {
      "responsible": {
        "title": "Ответственный за защиту данных",
        "content": "Ответственный за обработку персональных данных на этом сайте:\n\nИмя: Мухаммадали Рахимов\nАдрес: Firmianstrasse 3, 94036 Passau, Германия\nТелефон: +49 992 944424424\nЭлектронная почта: rahimov.muhammadali1704@gmail.com"
      },
      "overview": {
        "title": "Общая информация",
        "content": "Защита ваших персональных данных очень важна для нас. Мы обрабатываем ваши данные исключительно в рамках законов ЕС и Германии о защите данных, в частности GDPR (Общий регламент по защите данных).\n\nЭтот сайт является частным информационным и портфолио-сайтом без зарегистрированной компании. Мы не храним пользовательские данные в базе данных."
      },
      "dataCollection": {
        "title": "Какие данные собираются",
        "content": "При использовании нашего сайта автоматически собираются следующие данные:\n\n• IP-адрес\n• Дата и время доступа\n• Браузер и операционная система\n• Посещенные страницы\n\nЭти данные сохраняются в файлах журналов сервера (Server-Log-Dateien) и используются для технического анализа и улучшения сайта."
      },
      "cookies": {
        "title": "Использование Cookie",
        "content": "Наш сайт использует cookies. Cookies — это небольшие текстовые файлы, которые сохраняются на вашем компьютере.\n\nМы используем только необходимые cookies:\n\n• Сохранение выбора языка\n• Сохранение согласия на cookies\n• Техническая функциональность сайта\n\nМы не используем аналитические или отслеживающие cookies без вашего согласия. Вы можете отключить cookies в настройках браузера."
      },
      "contactForm": {
        "title": "Контактная форма",
        "content": "Если вы свяжетесь с нами через сайт, предоставленные вами данные (имя, электронная почта, сообщение) будут использованы исключительно для обработки вашего запроса и удалены после ответа."
      },
      "externalLinks": {
        "title": "Внешние ссылки",
        "content": "Наш сайт содержит ссылки на внешние сайты (например, GitHub, Portfolio). Мы не несем ответственности за их содержимое. Для защиты данных на этих сайтах, пожалуйста, ознакомьтесь с их политикой конфиденциальности."
      },
      "hosting": {
        "title": "Размещение сайта (Хостинг)",
        "content": "Этот сайт размещен на Vercel. Vercel Inc., 340 S Lemon Ave #4133, Walnut, CA 91789, USA.\n\nVercel может собирать технические данные (IP-адрес, время доступа) для предоставления услуг. Для получения дополнительной информации о защите данных на Vercel посетите их сайт."
      },
      "userRights": {
        "title": "Ваши права",
        "content": "В соответствии с GDPR у вас есть следующие права:\n\n• Право на получение информации о сохраненных данных\n• Право на исправление неверных данных\n• Право на удаление данных\n• Право на ограничение обработки\n• Право на переносимость данных\n• Право возражения против обработки\n\nДля реализации этих прав, пожалуйста, свяжитесь с нами, используя контактные данные, указанные выше."
      },
      "dataProtectionAuthority": {
        "title": "Право на жалобу",
        "content": "Вы имеете право подать жалобу в надзорный орган по защите данных, если считаете, что обработка ваших данных незаконна."
      },
      "changes": {
        "title": "Изменения политики конфиденциальности",
        "content": "Мы оставляем за собой право изменять данную политику конфиденциальности. Актуальная версия всегда доступна на этой странице."
      },
      "disclaimer": {
        "title": "Примечание",
        "content": "Это частный информационный сайт. Мы не ведем коммерческую деятельность и не храним данные в базе данных. Вся предоставленная информация предназначена исключительно для информационных целей."
      }
    }
  },
  "cookies": {
    "title": "Политика файлов Cookie",
    "lastUpdated": "24 декабря 2025 г.",
    "sections": {
      "what": {
        "title": "Что такое Cookie?",
        "content": "Cookie — это небольшой текстовый файл, который веб-сайт сохраняет на вашем компьютере или мобильном устройстве. Cookies позволяют сайту распознать вас и запомнить ваши настройки."
      },
      "types": {
        "title": "Типы Cookie",
        "content": "Мы используем два типа cookies:\n\n1. Необходимые cookies:\n• Необходимы для основной функциональности сайта\n• Сохраняют выбор языка\n• Сохраняют согласие на cookies\n• Используются без согласия\n\n2. Опциональные cookies:\n• Для анализа и статистики\n• Только с вашего согласия\n• В настоящее время на сайте отсутствуют"
      },
      "consent": {
        "title": "Механизм согласия",
        "content": "При первом посещении сайта вы увидите баннер cookie. Вы можете выбрать:\n\n• Принять все - все cookies будут активированы\n• Только необходимые - будут использованы только необходимые cookies\n• Узнать больше - переход на эту страницу\n\nВаше согласие сохраняется в вашем браузере."
      },
      "withdraw": {
        "title": "Отзыв согласия",
        "content": "Вы можете в любое время отозвать свое согласие:\n\n• Удалите cookies в вашем браузере\n• Очистите локальное хранилище браузера\n• Баннер cookie появится снова\n\nПосле отзыва будут использоваться только необходимые cookies."
      },
      "thirdParty": {
        "title": "Cookies третьих сторон",
        "content": "В настоящее время мы не используем cookies третьих сторон. Если в будущем такие cookies будут добавлены, мы уведомим вас об этом и запросим согласие."
      },
      "control": {
        "title": "Управление Cookies",
        "content": "Вы можете управлять cookies в вашем браузере:\n\n• Chrome: Настройки > Конфиденциальность и безопасность > Файлы cookie\n• Firefox: Настройки > Приватность и защита\n• Safari: Настройки > Конфиденциальность\n• Edge: Настройки > Файлы cookie и разрешения сайтов\n\nЕсли вы заблокируете cookies, некоторые функции сайта могут не работать."
      },
      "moreInfo": {
        "title": "Дополнительная информация",
        "content": "По вопросам использования cookies, пожалуйста, свяжитесь с нами:\n\nЭлектронная почта: rahimov.muhammadali1704@gmail.com"
      }
    }
  },
  "imprint": {
    "title": "Выходные данные",
    "lastUpdated": "24 декабря 2025 г.",
    "sections": {
      "responsible": {
        "title": "Ответственный за содержание",
        "content": "В соответствии с § 5 TMG и § 18 (2) MStV:\n\nИмя: Мухаммадали Рахимов\nАдрес: Firmianstrasse 3\n94036 Passau\nГермания\n\nТелефон: +49 992 944424424\nЭлектронная почта: rahimov.muhammadali1704@gmail.com"
      },
      "websiteType": {
        "title": "Тип сайта",
        "content": "Это частный информационный и портфолио сайт. Сайт:\n\n• Не является зарегистрированной компанией\n• Не ведет коммерческую деятельность\n• Не имеет электронной коммерции\n• Не хранит пользовательские данные в базе данных\n\nВся предоставленная информация предназначена исключительно для информационных и образовательных целей."
      },
      "liability": {
        "title": "Ответственность за содержание",
        "content": "Содержание наших страниц было создано с максимальной тщательностью. Однако мы не можем гарантировать правильность, полноту и актуальность информации.\n\nВ соответствии с §§ 7-10 TMG мы как поставщик услуг несем ответственность за собственное содержание, но не обязаны проверять внешнюю информацию или проводить активные расследования.\n\nКак только нам станет известно о нарушениях закона, мы немедленно удалим содержимое."
      },
      "externalLinks": {
        "title": "Ответственность за ссылки",
        "content": "Наш сайт содержит ссылки на внешние сайты. Мы не имеем контроля над их содержимым и не несем ответственности.\n\nСсылки были проверены на момент размещения, и не было обнаружено нарушений закона. Постоянный контроль ссылок без конкретного указания на нарушение невозможен.\n\nКак только нам станет известно о нарушениях прав, мы немедленно удалим соответствующие ссылки."
      },
      "copyright": {
        "title": "Авторское право",
        "content": "Содержимое этого сайта (текст, изображения, графика, код) защищено авторским правом и принадлежит Мухаммадали Рахимову.\n\nИспользование, воспроизведение или распространение содержимого без письменного разрешения правообладателя запрещено.\n\nНекоторые части сайта могут содержать материалы под лицензиями открытого исходного кода, в этом случае применяется соответствующая лицензия."
      },
      "disputeResolution": {
        "title": "Разрешение споров",
        "content": "Европейская комиссия предоставляет платформу для онлайн-разрешения споров: https://ec.europa.eu/consumers/odr\n\nМы не участвуем в процедурах разрешения споров перед органом по урегулированию споров потребителей и не обязаны это делать."
      },
      "disclaimer": {
        "title": "Общее примечание",
        "content": "Этот сайт был создан исключительно в информационных целях. Информация предоставляется 'как есть', и мы не несем ответственности за ущерб, возникший в результате использования информации.\n\nВ соответствии с §312i (1) предложение 1 № 1-3 и §312i (2) BGB мы освобождены от прав потребителей на отказ, поскольку мы предоставляем социальные услуги."
      }
    }
  },
  "cookieBanner": {
    "title": "Мы используем Cookies",
    "description": "Мы используем cookies для обеспечения базовых функций и улучшения вашего опыта. Вы можете выбрать, какие cookies принять.",
    "acceptAll": "Принять все",
    "rejectOptional": "Только необходимые",
    "moreInfo": "Узнать больше",
    "essentialOnly": "Используются только необходимые cookies"
  }
}
